wlcs15/Arduino_Wemos_TTgo_D1_R32_ESPDuino-32_Waveshare_4inch_OpenMRN_WiFi/sdkconfig.defaults
# Classic ESP32 (Wemos D1 R32 / ESPDuino-32). Do not set esp32s3 here.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# OpenMRN + mDNS no longer fits the 1MB factory slot. NVS offset is unchanged.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# OpenMRN / libstdc++ on IDF 5.1
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# WiFi GridConnect (used in a later commit; enabled so the stack is present)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_MAX_SOCKETS=16

# Serial console on UART0 (CH340 /dev/ttyUSB0)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# wifi_cred.cpp wrap key uses mbedtls_hkdf (RFC 5869)
CONFIG_MBEDTLS_HKDF_C=y

# Hub address comes from mDNS _openlcb-can._tcp. Empty = no static fallback.
CONFIG_NODE_LCC_HUB_HOST=""
CONFIG_NODE_LCC_HUB_HOST2=""
CONFIG_NODE_LCC_HUB_PORT=12021
CONFIG_NODE_JMRI_MONITOR_HOST=""
CONFIG_NODE_JMRI_WEB_PORT=12080
CONFIG_NODE_JMRI_MONITOR_PORT=12021
